leetcode_472_concatenated_words.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 472. Concatenated Words</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 472. Concatenated Words</h1>
<ul class="org-ul">
<li><a href="can_you_break_down_the_problem_in_small_and_easily_to_solve_parts.html#ID-69D68202-BF1A-4D72-A0EC-DDCBAF112500">Can we break-down the problem in small and easily to solve parts?</a>  For a given word, find if it is possible to decompose it as words in the dictionary.  The search-space for this problem is \((i, j, k)\) which means if it possible to break down the word \(i\), starting on position \(j\) after breaking it already in \(k\) parts.  The problem left is to quickly find a part starting on the current position which can be solved using a <a href="trie.html#ID-5BC30FCA-3402-4DA7-89D9-7661FEBDA3A7">Trie</a>.  Time complexity is \(O(n \times s)\) where \(s\) is \(\max |w[i]|\).  Space complexity is \(\sum |w[i]|\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">findAllConcatenatedWordsInADict</span>(<span style="font-weight: bold;">self</span>, words: List[<span style="font-weight: bold;">str</span>]) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">str</span>]:
        root = {}
        <span style="font-weight: bold;">for</span> w <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">words</span>:
            node = root
            <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">w</span>:
                node.setdefault(c, {})
                node = node[c]
            <span style="font-weight: bold; font-style: italic;">node</span>[<span style="font-style: italic;">"$"</span>] = <span style="font-weight: bold; text-decoration: underline;">True</span>

        <span style="font-weight: bold; text-decoration: underline;">@cache</span>
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(i, j, k):
            <span style="font-weight: bold;">if</span> j == <span style="font-weight: bold;">len</span>(words[i]):
                <span style="font-weight: bold;">return</span> k &gt; 1
            node = root
            <span style="font-weight: bold;">while</span> j &lt; <span style="font-weight: bold;">len</span>(words[i]) <span style="font-weight: bold;">and</span> words[i][j] <span style="font-weight: bold;">in</span> node:
                node = node[words[i][j]]
                j += 1
                <span style="font-weight: bold;">if</span> <span style="font-style: italic;">"$"</span> <span style="font-weight: bold;">in</span> node <span style="font-weight: bold;">and</span> dfs(i, j, k + 1):
                    <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>

        <span style="font-weight: bold;">return</span> [w <span style="font-weight: bold;">for</span> i, w <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(words) <span style="font-weight: bold;">if</span> dfs(i, 0, 0)]
</pre>
</div>
</div>
</body>
</html>